SSLD/4-1 4.2 Value Reconsidered.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil
#+HTML_HEAD_EXTRA: <style>body {background: rgb(193, 230, 198) !important;}</style>
* 4-1 4.2 Value Reconsidered
#+begin_verse
Okay, so given the obvious limitations that Kahneman's prospect theory really sheds light on,
	what are some of the insights that SSLD can bring to the table?
I think the key question that we would raise is the whole idea of value.
In economics, you have like a set of standards to determine what value might be,
	like the market determines the value of a stock.
But then in interpersonal relationships, that doesn't really work that way.
One of the things that I always use as an example when I'm teaching my face-to-face class [LAUGH]
	is bringing gifts on Valentine's Day.
Let's suppose that you have a couple, they started dating and this is the first Valentine's Day.
The guy spent $100, bring some flowers and chocolate.
The woman was delighted
	and then she would be talking to her friends and showing it off to people at work or whatever.
So that gift carries a certain value,
	and the excitement generated is maybe extremely valuable to this person.
And then the guy would also feel very gratified
	when he gets feedback from the woman with regard to like how much she enjoyed receiving that gift.
So let us go like two, three, four years down the road, right?

Inflation and everything kicked in, maybe the guy, this time, spent $200 on similar gift.
And well, even with inflation,
	if you're spending $200, this would be a better looking bunch of flowers and chocolates.
But we're not sure
	that the value that is experienced by the woman
		would have gone up by almost 100%, right or 50%, or 30%.
I think there is a very good chance
	that the overall value would be less than the first time when it was experienced, right?
Even though they were only spending $100 back then.

So what the subjective experience of the value,
	or like some economists would call this utility, right?
Does not actually bear a simple relationship to the monetary market value of something.
So that actually would give us a lot of insight
	when we are looking at the arithmetic of love, so to speak, in any relationships.
	
Another important point that I want to emphasize, coming from a SSLD perspective,
	is that what is being valued varies from person to person.
Like someone who grows up with like privilege and easy access to material resources
	may not value material stuff that much.
But this person may, for instance, value autonomy because my parents are rich and powerful.
They're running my life and I'm well furnished with whatever I need,
	but I really would love to have more space for myself, right?
So that person would value this more.
But then, for someone who's like raised in a sort of a relatively deprived environment,
	then some of these material goods would carry more value for him or her.
You know, this is something that I always wished to have, but didn't, right?
So when we look at value, we have to pay attention to individuals.
And then the other thing that we always talk about, obviously,
	in SSLD is like because our needs do change, right?
So what we value actually would change as our needs change.
#+end_verse
** expression
prospect [prəˈspekt]: n. a particular event which will probably or definitely happen in the future – used especially when you want to talk about how you feel about it前景
insight [ˈɪnˌsaɪt]: n. the ability to understand and realize what people or situations are really like眼光
stock [stɒk]: n. a ↑share in a company股票
generate [ˈdʒenəˌreɪt]: v. to produce or cause something SYN create产生
gratify [ˈɡrætɪˌfaɪ]: v. to make someone feel pleased and satisfied满足
inflation [ɪnˈfleɪʃ(ə)n]: n. a continuing increase in prices, or the rate at which prices increase通货膨胀
overall [ˈoʊvərˌɔl]: adj. considering or including everything全部的, 全面的
monetary [ˈmʌnəˌteri]: adj. relating to money, especially all the money in a particular country货币的, 金融的
arithmetic [əˈrɪθmətɪk]: n. the science of numbers involving adding, multiplying etc算术, 算法
deprived [dɪˈpraɪvd]: adj. not having the things that are necessary for a comfortable or happy life贫穷的
--------------------
Given sth., + ...: 鉴于某事, + ...
shed light on sth.: 揭秘某事物
down the road: 在未来
kick in: 发生了
a bunch of flowers: 一串花
be furnished with sth.: 被供应某物/被配置某物

