SSLD/4-1 4.2 Value Reconsidered.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-19 Thu 08:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-orgf31a27f" class="outline-2">
<h2 id="orgf31a27f">4-1 4.2 Value Reconsidered</h2>
<div class="outline-text-2" id="text-orgf31a27f">
<p class="verse">
Okay, so given the obvious limitations that Kahneman's prospect theory really sheds light on,<br />
&#xa0;what are some of the insights that SSLD can bring to the table?<br />
I think the key question that we would raise is the whole idea of value.<br />
In economics, you have like a set of standards to determine what value might be,<br />
&#xa0;like the market determines the value of a stock.<br />
But then in interpersonal relationships, that doesn't really work that way.<br />
One of the things that I always use as an example when I'm teaching my face-to-face class [LAUGH]<br />
&#xa0;is bringing gifts on Valentine's Day.<br />
Let's suppose that you have a couple, they started dating and this is the first Valentine's Day.<br />
The guy spent $100, bring some flowers and chocolate.<br />
The woman was delighted<br />
&#xa0;and then she would be talking to her friends and showing it off to people at work or whatever.<br />
So that gift carries a certain value,<br />
&#xa0;and the excitement generated is maybe extremely valuable to this person.<br />
And then the guy would also feel very gratified<br />
&#xa0;when he gets feedback from the woman with regard to like how much she enjoyed receiving that gift.<br />
So let us go like two, three, four years down the road, right?<br />
<br />
Inflation and everything kicked in, maybe the guy, this time, spent $200 on similar gift.<br />
And well, even with inflation,<br />
&#xa0;if you're spending $200, this would be a better looking bunch of flowers and chocolates.<br />
But we're not sure<br />
&#xa0;that the value that is experienced by the woman<br />
&#xa0;&#xa0;would have gone up by almost 100%, right or 50%, or 30%.<br />
I think there is a very good chance<br />
&#xa0;that the overall value would be less than the first time when it was experienced, right?<br />
Even though they were only spending $100 back then.<br />
<br />
So what the subjective experience of the value,<br />
&#xa0;or like some economists would call this utility, right?<br />
Does not actually bear a simple relationship to the monetary market value of something.<br />
So that actually would give us a lot of insight<br />
&#xa0;when we are looking at the arithmetic of love, so to speak, in any relationships.<br />
<br />
Another important point that I want to emphasize, coming from a SSLD perspective,<br />
&#xa0;is that what is being valued varies from person to person.<br />
Like someone who grows up with like privilege and easy access to material resources<br />
&#xa0;may not value material stuff that much.<br />
But this person may, for instance, value autonomy because my parents are rich and powerful.<br />
They're running my life and I'm well furnished with whatever I need,<br />
&#xa0;but I really would love to have more space for myself, right?<br />
So that person would value this more.<br />
But then, for someone who's like raised in a sort of a relatively deprived environment,<br />
&#xa0;then some of these material goods would carry more value for him or her.<br />
You know, this is something that I always wished to have, but didn't, right?<br />
So when we look at value, we have to pay attention to individuals.<br />
And then the other thing that we always talk about, obviously,<br />
&#xa0;in SSLD is like because our needs do change, right?<br />
So what we value actually would change as our needs change.<br />
</p>
</div>
