SSLD/4-1 4.2 Value Reconsidered.html
<div id="outline-container-org42e000e" class="outline-3">
<h3 id="org42e000e">expression</h3>
<div class="outline-text-3" id="text-org42e000e">
<p>
prospect [prəˈspekt]: n. a particular event which will probably or definitely happen in the future – used especially when you want to talk about how you feel about it前景<br />
insight [ˈɪnˌsaɪt]: n. the ability to understand and realize what people or situations are really like眼光<br />
stock [stɒk]: n. a ↑share in a company股票<br />
generate [ˈdʒenəˌreɪt]: v. to produce or cause something SYN create产生<br />
gratify [ˈɡrætɪˌfaɪ]: v. to make someone feel pleased and satisfied满足<br />
inflation [ɪnˈfleɪʃ(ə)n]: n. a continuing increase in prices, or the rate at which prices increase通货膨胀<br />
overall [ˈoʊvərˌɔl]: adj. considering or including everything全部的, 全面的<br />
monetary [ˈmʌnəˌteri]: adj. relating to money, especially all the money in a particular country货币的, 金融的<br />
arithmetic [əˈrɪθmətɪk]: n. the science of numbers involving adding, multiplying etc算术, 算法<br />
deprived [dɪˈpraɪvd]: adj. not having the things that are necessary for a comfortable or happy life贫穷的<br />
</p>
<hr />
<p>
Given sth., + &#x2026;: 鉴于某事, + &#x2026;<br />
shed light on sth.: 揭秘某事物<br />
down the road: 在未来<br />
kick in: 发生了<br />
a bunch of flowers: 一串花<br />
be furnished with sth.: 被供应某物/被配置某物<br />
</p>
</div>
</div>

<div id="outline-container-org5bb42dc" class="outline-3">
<h3 id="org5bb42dc">sentence</h3>
<div class="outline-text-3" id="text-org5bb42dc">
<p>
prospect [prəˈspekt]: n. a particular event which will probably or definitely happen in the future – used especially when you want to talk about how you feel about it前景<br />
</p>
<ul class="org-ul">
<li>Because of the Prospect Theory, the professor was rewarded with the Nobel Prize.<br /></li>
<li>Many entreprenuers take advantage of the Prospect Theory to make big decisions about business.<br /></li>
<li>My wife is looking forward to the prospect of her shop in the Internet.<br /></li>
</ul>
<p>
insight [ˈɪnˌsaɪt]: n. the ability to understand and realize what people or situations are really like眼光<br />
</p>
<ul class="org-ul">
<li>His insight of politics trend on the continent made him rise to fame swiftly.<br /></li>
<li>The king admired him for the general's insight of battlefield.<br /></li>
<li>His insight of learning English is very different from all who take the course.<br /></li>
</ul>
<p>
stock [stɒk]: n. a ↑share in a company股票<br />
</p>
<ul class="org-ul">
<li>I have been assailed by a man who want to sell stocks to me.<br /></li>
<li>With two countries starting a war, the stocks of the company became worthless and it went bankrupt.<br /></li>
<li>My wife can't resist the temptation to buy the stocks from her classmate.<br /></li>
</ul>
<p>
generate [ˈdʒenəˌreɪt]: v. to produce or cause something SYN create产生<br />
</p>
<ul class="org-ul">
<li>The code shall generate a series of random numbers as veritification code.<br /></li>
<li>The generated poop can be an ingredient in fertilizer and gunpowder.<br /></li>
<li>He suffered from the generated side effect by these pills.<br /></li>
</ul>
<p>
gratify [ˈɡrætɪˌfaɪ]: v. to make someone feel pleased and satisfied满足<br />
</p>
<ul class="org-ul">
<li>When he took another angle to look at his son's grade, he got gratified.<br /></li>
<li>Customers usually get gratified because of the comprehensive service of the staff in the restaurant.<br /></li>
<li>A vacation at a seaside resort may gratify your wife.<br /></li>
</ul>
<p>
inflation [ɪnˈfleɪʃ(ə)n]: n. a continuing increase in prices, or the rate at which prices increase通货膨胀<br />
</p>
<ul class="org-ul">
<li>The workers was underway to parade to protest against inflation.<br /></li>
<li>The inflation parallelled the war the vicious king started.<br /></li>
<li>I can't afford to real estate deby anymore because of the inflation.<br /></li>
</ul>
<p>
overall [ˈoʊvərˌɔl]: adj. considering or including everything全部的, 全面的<br />
</p>
<ul class="org-ul">
<li>The overall value of the bridge is hard to be estimated.<br /></li>
<li>The overall score of the test means that I can't study abroad, which drives me mad.<br /></li>
<li>My overall score of the test is beyond the average score.<br /></li>
</ul>
<p>
monetary [ˈmʌnəˌteri]: adj. relating to money, especially all the money in a particular country货币的, 金融的<br />
</p>
<ul class="org-ul">
<li>Before we move to London, maybe we can throw some objects of little monetary value away.<br /></li>
<li>She values some objects which is of little monetary in our eyes.<br /></li>
<li>I have to pay more to buy the real estate because of the new monetary policy.<br /></li>
</ul>
<p>
arithmetic [əˈrɪθmətɪk]: n. the science of numbers involving adding, multiplying etc算术, 算法<br />
</p>
<ul class="org-ul">
<li>My aunt likes raising some questions about arithmetic.<br /></li>
<li>The article on arithmetic inspired awe in an eminent scientist.<br /></li>
<li>I am afraid I am not so good at arithmetic as you think.<br /></li>
</ul>
<p>
deprived [dɪˈpraɪvd]: adj. not having the things that are necessary for a comfortable or happy life贫穷的<br />
</p>
<ul class="org-ul">
<li>In China, children are difficult to go to university in deprived environments.<br /></li>
<li>Living in a deprived environment in his youth, he is very thrifty even though he is an entrepreneur now.<br /></li>
<li>Children in deprived environments still can't afford to go to university in this country.<br /></li>
</ul>
<hr />
<p>
Given sth., + &#x2026;: 鉴于某事, + &#x2026;<br />
</p>
<ul class="org-ul">
<li>Given what you played truant from school yesterday, the headmaster will round up you to stand trial in front of all staff.<br /></li>
<li>Given the limitations of meeting the queen, we shall have a conversation before.<br /></li>
<li>Given the stage fright, you have two opportunities to speak in public.<br /></li>
</ul>
<p>
shed light on sth.: 揭秘某事物<br />
</p>
<ul class="org-ul">
<li>The detective shed light on the criminal, who turned out to be the local grocer.<br /></li>
<li>The funeral shed light on the ghost at Endly farm, Frank who was supposed to be killed in action.<br /></li>
<li>The experts from the zoo shed light on the puma at large, which was in the possession of a private collector.<br /></li>
</ul>
<p>
down the road: 在未来<br />
</p>
<ul class="org-ul">
<li>There is a certain hope that we can afford to a vacation at a seaside resort down the road.<br /></li>
<li>The inflation will be tackled by the new regime down the road.<br /></li>
<li>Almost everyone will lead a happy life down the road.<br /></li>
</ul>
<p>
kick in: 发生了<br />
</p>
<ul class="org-ul">
<li>The monetary policy will kick in four years down the road.<br /></li>
<li>When an affair kicked in, she didn't choose to get divorced.<br /></li>
<li>A series of catastrophes kicked in in the suburb of the city.<br /></li>
</ul>
<p>
a bunch of flowers: 一串花<br />
</p>
<ul class="org-ul">
<li>My wife was delight that I presented her with a bunch of flowers on Valentina's Day.<br /></li>
<li>The leader came to hospital to console him with a bunch of flowers.<br /></li>
<li>I caught sight of a bunch of flowers in your room.<br /></li>
</ul>
<p>
be furnished with sth.: 被供应某物/被配置某物<br />
</p>
<ul class="org-ul">
<li>Furnished with whatever he wants, the prince has no mercy with his people.<br /></li>
<li>Furnished with a spear gun, two men on the desert island feasted on lobsters everyday.<br /></li>
<li>The ship that is furnished with 16 water-tight compartments was regarded as unsinkable.<br /></li>
</ul>
</div>
</div>
