SSLD/4-1 4.2 Value Reconsidered.org
** sentence2
prospect [prəˈspekt]: n. a particular event which will probably or definitely happen in the future – used especially when you want to talk about how you feel about it前景
- Because of the Prospect Theory, the professor was rewarded with the Nobel Prize.
- Many entrepreneurs take advantage of the prospect theory to make big decisions about businesses.
- My wife is looking forward to the prospect of her shop on the Internet.
insight [ˈɪnˌsaɪt]: n. the ability to understand and realize what people or situations are really like眼光
- His insight into political trends on the continent made him rise to fame swiftly.
- The king admired him for the general's insight of the battlefield.
- His insight into learning English is very different from that of all who take the course.
stock [stɒk]: n. a ↑share in a company股票
- I have been assailed by a man who wants to sell stocks to me.
- With two countries starting a war, the stocks of the company became worthless and it went bankrupt.
- My wife can't resist the temptation to buy the stocks from her classmate.
generate [ˈdʒenəˌreɪt]: v. to produce or cause something SYN create产生
- The code shall generate a series of random numbers as verification code.
- The generated poop can be an ingredient in fertilizer and gunpowder.
- He suffered from the generated side effects of these pills.
gratify [ˈɡrætɪˌfaɪ]: v. to make someone feel pleased and satisfied满足
- When he took another angle to look at his son's grade, he got gratified.
- Customers usually get gratified because of the comprehensive service of the staff in the restaurant.
- A vacation at a seaside resort may gratify your wife.
inflation [ɪnˈfleɪʃ(ə)n]: n. a continuing increase in prices, or the rate at which prices increase通货膨胀
- The workers were underway to parade to protest against inflation.
- The inflation parallelled the war the vicious king started.
- I can't afford real estate debt anymore because of the inflation.
overall [ˈoʊvərˌɔl]: adj. considering or including everything全部的, 全面的
- The overall value of the bridge is hard to estimate.
- The overall score on the test means that I can't study abroad, which drives me mad.
- My overall score on the test is beyond the average score.
monetary [ˈmʌnəˌteri]: adj. relating to money, especially all the money in a particular country货币的, 金融的
- Before we move to London, maybe we can throw some objects of little monetary value away.
- She values some objects of little monetary in our opinions.
- I have to pay more to buy real estate because of the new monetary policy.
arithmetic [əˈrɪθmətɪk]: n. the science of numbers involving adding, multiplying etc算术, 算法
- My aunt likes raising some questions about arithmetic. 
- The article on arithmetic inspired awe in an eminent scientist.
- I am afraid I am not as good at arithmetic as you think.
deprived [dɪˈpraɪvd]: adj. not having the things that are necessary for a comfortable or happy life贫穷的
- In China, children in deprived environments find it difficult to go to university.
- Living in a deprived environment in his youth, he is very thrifty even though he is an entrepreneur now.
- Children in deprived environments still can't afford to go to university in this country.
--------------------
Given sth., + ...: 鉴于某事, + ...
- Given that you played truant from school yesterday, the headmaster will round up you to stand trial in front of all staff.
- Given the limitations of meeting the queen, we shall have a conversation before.
- Given your stage fright, you have another chance to speak in public.
shed light on sth.: 揭秘某事物
- The detective shed light on the criminal, who turned out to be the local grocer.
- The funeral shed light on the ghost at Endly farm, Frank who was supposed to be killed in action.
- The experts from the zoo shed light on the puma at large, which was in the possession of a private collector.
down the road: 在未来
- There is a certain hope that we can afford a vacation at a seaside resort down the road.
- The inflation will be tackled by the new regime down the road.
- Almost everyone will lead a happy life down the road.
kick in: 发生了
- The monetary policy will kick in four years down the road.
- When an affair kicked in, she didn't choose to get divorced.
- A series of catastrophes kicked in in the suburbs of the city.
a bunch of flowers: 一串花
- My wife was delighted that I presented her with a bunch of flowers on Valentine's Day.
- The leader came to the hospital to console him with a bunch of flowers.
- I caught sight of a bunch of flowers in your room.
be furnished with sth.: 被供应某物/被配置某物
- Furnished with whatever he wants, the prince has no mercy on his people.
- Furnished with a spear gun, two men on the desert island feasted on lobsters every day.
- The ship that is furnished with 16 water-tight compartments was regarded as unsinkable.
