SSLD/4-1 4.2 Value Reconsidered.html
<div id="outline-container-orgb55d2e0" class="outline-3">
<h3 id="orgb55d2e0">sentence2</h3>
<div class="outline-text-3" id="text-orgb55d2e0">
<p>
prospect [prəˈspekt]: n. a particular event which will probably or definitely happen in the future – used especially when you want to talk about how you feel about it前景<br />
</p>
<ul class="org-ul">
<li>Because of the Prospect Theory, the professor was rewarded with the Nobel Prize.<br /></li>
<li>Many entrepreneurs take advantage of the prospect theory to make big decisions about businesses.<br /></li>
<li>My wife is looking forward to the prospect of her shop on the Internet.<br /></li>
</ul>
<p>
insight [ˈɪnˌsaɪt]: n. the ability to understand and realize what people or situations are really like眼光<br />
</p>
<ul class="org-ul">
<li>His insight into political trends on the continent made him rise to fame swiftly.<br /></li>
<li>The king admired him for the general's insight of the battlefield.<br /></li>
<li>His insight into learning English is very different from that of all who take the course.<br /></li>
</ul>
<p>
stock [stɒk]: n. a ↑share in a company股票<br />
</p>
<ul class="org-ul">
<li>I have been assailed by a man who wants to sell stocks to me.<br /></li>
<li>With two countries starting a war, the stocks of the company became worthless and it went bankrupt.<br /></li>
<li>My wife can't resist the temptation to buy the stocks from her classmate.<br /></li>
</ul>
<p>
generate [ˈdʒenəˌreɪt]: v. to produce or cause something SYN create产生<br />
</p>
<ul class="org-ul">
<li>The code shall generate a series of random numbers as verification code.<br /></li>
<li>The generated poop can be an ingredient in fertilizer and gunpowder.<br /></li>
<li>He suffered from the generated side effects of these pills.<br /></li>
</ul>
<p>
gratify [ˈɡrætɪˌfaɪ]: v. to make someone feel pleased and satisfied满足<br />
</p>
<ul class="org-ul">
<li>When he took another angle to look at his son's grade, he got gratified.<br /></li>
<li>Customers usually get gratified because of the comprehensive service of the staff in the restaurant.<br /></li>
<li>A vacation at a seaside resort may gratify your wife.<br /></li>
</ul>
<p>
inflation [ɪnˈfleɪʃ(ə)n]: n. a continuing increase in prices, or the rate at which prices increase通货膨胀<br />
</p>
<ul class="org-ul">
<li>The workers were underway to parade to protest against inflation.<br /></li>
<li>The inflation parallelled the war the vicious king started.<br /></li>
<li>I can't afford real estate debt anymore because of the inflation.<br /></li>
</ul>
<p>
overall [ˈoʊvərˌɔl]: adj. considering or including everything全部的, 全面的<br />
</p>
<ul class="org-ul">
<li>The overall value of the bridge is hard to estimate.<br /></li>
<li>The overall score on the test means that I can't study abroad, which drives me mad.<br /></li>
<li>My overall score on the test is beyond the average score.<br /></li>
</ul>
<p>
monetary [ˈmʌnəˌteri]: adj. relating to money, especially all the money in a particular country货币的, 金融的<br />
</p>
<ul class="org-ul">
<li>Before we move to London, maybe we can throw some objects of little monetary value away.<br /></li>
<li>She values some objects of little monetary in our opinions.<br /></li>
<li>I have to pay more to buy real estate because of the new monetary policy.<br /></li>
</ul>
<p>
arithmetic [əˈrɪθmətɪk]: n. the science of numbers involving adding, multiplying etc算术, 算法<br />
</p>
<ul class="org-ul">
<li>My aunt likes raising some questions about arithmetic.<br /></li>
<li>The article on arithmetic inspired awe in an eminent scientist.<br /></li>
<li>I am afraid I am not as good at arithmetic as you think.<br /></li>
</ul>
<p>
deprived [dɪˈpraɪvd]: adj. not having the things that are necessary for a comfortable or happy life贫穷的<br />
</p>
<ul class="org-ul">
<li>In China, children in deprived environments find it difficult to go to university.<br /></li>
<li>Living in a deprived environment in his youth, he is very thrifty even though he is an entrepreneur now.<br /></li>
<li>Children in deprived environments still can't afford to go to university in this country.<br /></li>
</ul>
<hr />
<p>
Given sth., + &#x2026;: 鉴于某事, + &#x2026;<br />
</p>
<ul class="org-ul">
<li>Given that you played truant from school yesterday, the headmaster will round up you to stand trial in front of all staff.<br /></li>
<li>Given the limitations of meeting the queen, we shall have a conversation before.<br /></li>
<li>Given your stage fright, you have another chance to speak in public.<br /></li>
</ul>
<p>
shed light on sth.: 揭秘某事物<br />
</p>
<ul class="org-ul">
<li>The detective shed light on the criminal, who turned out to be the local grocer.<br /></li>
<li>The funeral shed light on the ghost at Endly farm, Frank who was supposed to be killed in action.<br /></li>
<li>The experts from the zoo shed light on the puma at large, which was in the possession of a private collector.<br /></li>
</ul>
<p>
down the road: 在未来<br />
</p>
<ul class="org-ul">
<li>There is a certain hope that we can afford a vacation at a seaside resort down the road.<br /></li>
<li>The inflation will be tackled by the new regime down the road.<br /></li>
<li>Almost everyone will lead a happy life down the road.<br /></li>
</ul>
<p>
kick in: 发生了<br />
</p>
<ul class="org-ul">
<li>The monetary policy will kick in four years down the road.<br /></li>
<li>When an affair kicked in, she didn't choose to get divorced.<br /></li>
<li>A series of catastrophes kicked in in the suburbs of the city.<br /></li>
</ul>
<p>
a bunch of flowers: 一串花<br />
</p>
<ul class="org-ul">
<li>My wife was delighted that I presented her with a bunch of flowers on Valentine's Day.<br /></li>
<li>The leader came to the hospital to console him with a bunch of flowers.<br /></li>
<li>I caught sight of a bunch of flowers in your room.<br /></li>
</ul>
<p>
be furnished with sth.: 被供应某物/被配置某物<br />
</p>
<ul class="org-ul">
<li>Furnished with whatever he wants, the prince has no mercy on his people.<br /></li>
<li>Furnished with a spear gun, two men on the desert island feasted on lobsters every day.<br /></li>
<li>The ship that is furnished with 16 water-tight compartments was regarded as unsinkable.<br /></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
